Catalogs/СодержанияРабот_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СодержанияРабот_ат</Name>
			<Comment>!!!!!HOTFIX</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткосрочныеРаботы</Name>
					<Comment>!!!!!HOTFIX</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимЭкземплярПродукта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИТС_временное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоговоров_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвойстваЭкземпляровПродуктов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПродукта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПродуктов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСвойства</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СодержанияРабот_ат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СвойстваЭкземпляровПродуктовСвойствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элементы.СвойстваЭкземпляровПродуктов.ТекущиеДанные.ТипПродукта) Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьСвойстваПоТипуПродукта(Элементы.СвойстваЭкземпляровПродуктов.ТекущиеДанные.ТипПродукта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ПолучитьСвойстваПоТипуПродукта(ТипПродукта)
	
	ИмяРегистраСпецификацииПродуктов = УчетПродуктов_ат.ПолучитьИмяРегистраСпецификацииЭкземпляраПродукта(ТипПродукта);
	
	Свойства = Новый СписокЗначений;
	
	Для Каждого Ресурс Из Метаданные.РегистрыСведений[ИмяРегистраСпецификацииПродуктов].Ресурсы Цикл
		
		Свойства.Добавить(Ресурс.Имя, Ресурс.Синоним);
		
	КонецЦикла;
	
	Возврат Свойства;
	
КонецФункции

&НаСервере
Процедура ПодготовитьВыборЗначенияСвойстваПродукта(Свойство, ТипПродукта)
	
	Если ЗначениеЗаполнено(Свойство) Тогда
		
		ИмяРегистраСпецификацииПродуктов = УчетПродуктов_ат.ПолучитьИмяРегистраСпецификацииЭкземпляраПродукта(ТипПродукта);
		
		Если НЕ ПустаяСтрока(ИмяРегистраСпецификацииПродуктов) Тогда
			
			Ресурс = Метаданные.РегистрыСведений[ИмяРегистраСпецификацииПродуктов].Ресурсы[Свойство];
			Типы = Ресурс.Тип.Типы();
			
			ОписаниеТипов = Новый ОписаниеТипов(Типы);
			
			Элементы.СвойстваЭкземпляровПродуктовЗначениеСвойства.ОграничениеТипа = ОписаниеТипов;
			Элементы.СвойстваЭкземпляровПродуктовЗначениеСвойства.ПараметрыВыбора = Ресурс.ПараметрыВыбора;
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЭкземпляровПродуктовПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "СвойстваЭкземпляровПродуктовЗначениеСвойства" Тогда
		
		ПодготовитьВыборЗначенияСвойстваПродукта(Элементы.СвойстваЭкземпляровПродуктов.ТекущиеДанные.Свойство, Элементы.СвойстваЭкземпляровПродуктов.ТекущиеДанные.ТипПродукта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЭкземпляровПродуктовТипПродуктаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СвойстваЭкземпляровПродуктов.ТекущиеДанные;
	
	ТекущиеДанные.Свойство = "";
	ТекущиеДанные.ЗначениеСвойства = Неопределено;
	
КонецПроцедуры
